# On Derivatives导数

Ceres Solver与所有基于梯度的优化算法一样，依赖于能够计算目标函数及其域中任意点的导数。事实上，定义目标函数及其雅可比行列式是用户使用 Ceres Solver 解决优化问题时需要执行的主要任务。正确且高效的计算雅可比行列式是良好性能的关键。

Ceres Solver在用户如何向求解器提供导数方面提供了相当大的灵活性。可以使用的方法包括：

1. 分析导数：用户自己手动或使用Maple或Mathematica等工具计算出导数，并在 CostFunction中实现它们。

2. 数值导数：Ceres 使用有限差分以数值方式计算导数。

3. 自动导数：Ceres 使用C++模板和运算符重载自动计算解析导数。

具体使用这三种方法中的哪一种（单独或组合），应结合实际情况和用户愿意做出权衡。不幸的是，数值优化教科书很少详细讨论这些原则，用户通常只能自己进行判断。

本文的目的是填补这一空白，并在Ceres Solver的使用中描述这三种方法，并提供足够的详细信息，以便用户可以做出明智的选择。

对于等不及的用户，这里有一些高级建议:


1. 使用自动求导作为首选。

2. 在某些情况下，可以考虑使用分析导数。

3. 避免数值导数。实在无法避免的时候使用它，主要场景是需要与外部库交互时。

继续阅读本章的剩余内容，来详细了解这些求导方法。